{"backend": "tensorflow", "keras_version": "2.2.2", "config": [{"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "name": "conv2d_1", "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [6, 6], "batch_input_shape": [null, 65, 65, 1], "bias_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "trainable": true, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "valid", "name": "conv2d_2", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "bias_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "valid", "name": "conv2d_3", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [6, 6], "bias_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "valid", "name": "conv2d_4", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [6, 6], "bias_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "activation": "linear", "name": "dense_1", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "units": 2592}, "class_name": "Dense"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "rate": 0.2, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "activation": "linear", "name": "dense_2", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "units": 18}, "class_name": "Dense"}, {"config": {"name": "activation_6", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}